LBL-Jupyter-talk.org
#+OPTIONS: toc:nil num:nil reveal_title_slide:nil
#+REVEAL_HLEVEL: 2
#+REVEAL_THEME: serif
* Tech Dive Into Kubernetes + JupyterHub + JupyterLab at LSST
* LSST
** Feeds and Speeds

[[https://www.lsst.org/scientists/keynumbers][This]] is the usual overview of what the LSST is going to be doing, and
how much of it there is.

** Notebook Environment ("nublado")

This is the LSST Science Platform Interactive Notebook Component.
Basically, it's a way of letting scientists quickly iterate through
hypotheses looking for the ones interesting enough to burn a lot of
resources investigating.

My [[https://youtu.be/Xc0rUVznx1k?list=PL055Epbe6d5b572IRmYAHkUgcq3y6K3Ae][talk at JupyterCon last year]] ([[https://athornton.github.io/JupyterCon-2018-talk][slides]]) is not a bad overview,
if I do say so myself.

* Fundamental assumptions
** Kubernetes is the right level of abstraction

*** Containerization

We don't have to care about the vagaries of the underlying Linux
distribution, much less the specifics of the hardware (or virtual hosts)
or underlying network topology.

**** Docker

You don't have to run Docker as your container, but this talk is going
to assume you do, because that's what we do.

#+REVEAL: split

**** Singularity

If and when Kubernetes gets the ability to talk to Singularity well,
then maybe it's worth considering, but Singularity as usually deployed
(that is, good old setuid for container setup) doesn't strike me as
meaningfully more secure than Docker, and you lose the network
namespace.

I am very unconvinced that Singularity is a good answer to the "Docker
on my HPC environment?  AW HELL NO!" issue.

*** Composability

Kubernetes abstractions (e.g. the service) are designed such that we can
load-balance and (in some cases) get HA without having to work very hard
at it.  The deployment manages container lifecycles so we have the right
number of a given component running.  We don't have to manage the
(miserable) Docker-container-port-to-host-port mapping stuff ourselves.

This is where Kubernetes is magnificent.

*** Ubiquity

**** If you are not a data center service provider

Demand your service provider give you a Kubernetes interface.  The major
public clouds already do.

**** If you are a data center service provider

You either already do provide a managed Kubernetes service or you're
going to have to.  The longer you wait the more it will hurt.

*** Orchestrateable

**** Kustomize

Kustomize is now part of Kubernetes as of 1.14 and it looks like it will
provide most of what we need.  I plan to port our deployment process to
it soonish.

**** Terraform

Terraform is kind of heavyweight and has a learning curve, but does seem
to work reasonably well.

#+REVEAL: split

**** Helm

I just don't like Helm.  The templating is the easy part, and it doesn't
help at all with sequencing, and Tiller doesn't play nice with RBAC.
But Tiller is gone in Helm 3 (now in Alpha)...so maybe it's worth a
revisit. 

** JupyterHub

Why write your own spawner?  I haven't heard a convincing reason.

** JupyterLab

No sense in starting, several years from Science First Light, with
something that's already being supplanted.

You can still get the Classic Notebook view from it, if you have users
with notebooks that rely on things JupyterLab doesn't have extensions
for.  Encourage them to write those extensions or at least open issues.

* Jupyter Configuration
** RBAC

Don't be afraid of RBAC.  It's not that bad.  Create service accounts,
roles, and rolebindings for the capabilities your system needs (mostly
the Hub, but not entirely).

[[https://github.com/lsst-sqre/nublado/tree/master/jupyterhub/kubernetes][This is an example]] for JupyterHub.

** Modular config files as ConfigMaps
*** Examples

This is a [[https://github.com/lsst-sqre/nublado/blob/master/jupyterhub/jupyterhub_config/jupyterhub_config.py][JupyterHub minimal configuration wrapper]] that loads the (sorted)
contents of a configuration directory.

This is [[https://github.com/lsst-sqre/nublado/blob/master/jupyterhub/sample_configs/30-environment.py][one of the files it loads.]]

*** Substitute values from secrets or environment

Let's look in a bit more detail at
[[https://github.com/lsst-sqre/nublado/blob/master/jupyterhub/sample_configs/30-environment.py][that file]].

*** ConfigMaps should be usable across sites.

If they are not, then you need to have more environmental variables or
secrets, and set configuration variables from them.

** Make authentication someone else's problem

This is one of the classical examples of "you really shouldn't do it
yourself."

Are you *really* such a special snowflake that "users are members of
groups, and groups map to capabilities" won't work for you?

*** OAuth2 is generally a very good solution

Widely supported, good JupyterHub support, easy to add support for new
providers by cargo-culting existing providers in JupyterHub...

[[https://github.com/lsst-sqre/nublado/blob/master/jupyterhub/sample_configs/10-authenticator.py][This]] is our configuration.

*** We use JWT for SSO and it seems to work fine

Some [[https://github.com/lsst-sqre/nublado/blob/master/proxy/kubernetes/ingress.template.yml#L11][ingress annotations]] for Nginx so if you don't have the right
headers you're redirected through an OAuth flow, and then you get the
right headers.  [[https://github.com/lsst-sqre/nublado/blob/master/jupyterhub/sample_configs/10-authenticator.py#L315][Validate and parse those headers]] when you receive them
in the Hub, and you're done.

*** The NCSA IDP for CILogon supports associated identities

Once you set up your NCSA identity, you can link it to other
CILogon-supported auth systems and use those (e.g. GitHub, SLAC,
Caltech...) to do the OAuth flow.  You still get back the NCSA
user/group info, but you can authenticate through another provider.

If you're me and your computer has been on more than ten minutes you're
probably authenticated to Google or GitHub already.

*** Your authenticator should support a "group" concept.

This makes data access (see below) and user capabilities easy to
implement.  A group, almost by definition, maps to a set of capabilities
(although those capabilities are often not factored in a useful way).

** Make your spawner spawn each user's resources in a separate namespace

Kubespawner now supports this directly (although we're using an earlier
implementation until I have time to migrate us).

