LBL-Jupyter-talk.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title></title>
<meta name="author" content="(Adam Thornton)"/>
<link rel="stylesheet" href="./reveal.js/css/reveal.css"/>

<link rel="stylesheet" href="./reveal.js/css/theme/serif.css" id="theme"/>


<!-- If the query includes 'print-pdf', include the PDF print sheet -->
</head>
<body>
<div class="reveal">
<div class="slides">
<section>
<section id="slide-sec-">
<h2 id="orga75b56a">Tech Dive Into Kubernetes + JupyterHub + JupyterLab at LSST</h2>
</section>
</section>
<section>
<section id="slide-sec-">
<h2 id="org249e8f8">LSST</h2>
<div class="outline-text-2" id="text-org249e8f8">
</div>
</section>
</section>
<section>
<section id="slide-sec-">
<h3 id="orga6d3a5d">Feeds and Speeds</h3>
<p>
<a href="https://www.lsst.org/scientists/keynumbers">This</a> is the usual overview of what the LSST is going to be doing, and
how much of it there is.
</p>

</section>
</section>
<section>
<section id="slide-sec-">
<h3 id="orgd3131bb">Notebook Environment ("nublado")</h3>
<p>
This is the LSST Science Platform Interactive Notebook Component.
Basically, it's a way of letting scientists quickly iterate through
hypotheses looking for the ones interesting enough to burn a lot of
resources investigating.
</p>

<p>
My <a href="https://youtu.be/Xc0rUVznx1k?list=PL055Epbe6d5b572IRmYAHkUgcq3y6K3Ae">talk at JupyterCon last year</a> (<a href="https://athornton.github.io/JupyterCon-2018-talk">slides</a>) is not a bad overview,
if I do say so myself.
</p>

</section>
</section>
<section>
<section id="slide-sec-">
<h2 id="org8157367">Fundamental assumptions</h2>
<div class="outline-text-2" id="text-org8157367">
</div>
</section>
</section>
<section>
<section id="slide-sec-">
<h3 id="org3b8be5b">Kubernetes is the right level of abstraction</h3>
<div class="outline-text-3" id="text-org3b8be5b">
</div>
</section>
<section id="slide-sec-">
<h4 id="org70024d1">Containerization</h4>
<p>
We don't have to care about the vagaries of the underlying Linux
distribution, much less the specifics of the hardware (or virtual hosts)
or underlying network topology.
</p>

<ul class="org-ul">
<li><a id="org38218ab"></a>Docker<br />
<p>
You don't have to run Docker as your container, but this talk is going
to assume you do, because that's what we do.
</p>

</section>
<section >
</li>

<li><a id="org1a222e5"></a>Singularity<br />
<p>
If and when Kubernetes gets the ability to talk to Singularity well,
then maybe it's worth considering, but Singularity as usually deployed
(that is, good old setuid for container setup) doesn't strike me as
meaningfully more secure than Docker, and you lose the network
namespace.
</p>

<p>
I am very unconvinced that Singularity is a good answer to the "Docker
on my HPC environment?  AW HELL NO!" issue.
</p>
</li>
</ul>

</section>
<section id="slide-sec-">
<h4 id="org9efe56b">Composability</h4>
<p>
Kubernetes abstractions (e.g. the service) are designed such that we can
load-balance and (in some cases) get HA without having to work very hard
at it.  The deployment manages container lifecycles so we have the right
number of a given component running.  We don't have to manage the
(miserable) Docker-container-port-to-host-port mapping stuff ourselves.
</p>

<p>
This is where Kubernetes is magnificent.
</p>

</section>
<section id="slide-sec-">
<h4 id="org2420fcb">Ubiquity</h4>
<div class="outline-text-4" id="text-org2420fcb">
</div>
<ul class="org-ul">
<li><a id="org535c0a8"></a>If you are not a data center service provider<br />
<p>
Demand your service provider give you a Kubernetes interface.  The major
public clouds already do.
</p>
</li>

<li><a id="org5129e38"></a>If you are a data center service provider<br />
<p>
You either already do provide a managed Kubernetes service or you're
going to have to.  The longer you wait the more it will hurt.
</p>
</li>
</ul>

</section>
<section id="slide-sec-">
<h4 id="orgdd6e75d">Orchestrateable</h4>
<div class="outline-text-4" id="text-orgdd6e75d">
</div>
<ul class="org-ul">
<li><a id="orge32fd6a"></a>Kustomize<br />
<p>
Kustomize is now part of Kubernetes as of 1.14 and it looks like it will
provide most of what we need.  I plan to port our deployment process to
it soonish.
</p>
</li>

<li><a id="org89b5cca"></a>Terraform<br />
<p>
Terraform is kind of heavyweight and has a learning curve, but does seem
to work reasonably well.
</p>

</section>
<section >
</li>

<li><a id="org3f505fb"></a>Helm<br />
<p>
I just don't like Helm.  The templating is the easy part, and it doesn't
help at all with sequencing, and Tiller doesn't play nice with RBAC.
But Tiller is gone in Helm 3 (now in Alpha)&#x2026;so maybe it's worth a
revisit. 
</p>
</li>
</ul>

</section>
</section>
<section>
<section id="slide-sec-">
<h3 id="org0cd59cc">JupyterHub</h3>
<p>
Why write your own spawner?  I haven't heard a convincing reason.
</p>

</section>
</section>
<section>
<section id="slide-sec-">
<h3 id="org65b2e24">JupyterLab</h3>
<p>
No sense in starting, several years from Science First Light, with
something that's already being supplanted.
</p>

<p>
You can still get the Classic Notebook view from it, if you have users
with notebooks that rely on things JupyterLab doesn't have extensions
for.  Encourage them to write those extensions or at least open issues.
</p>

</section>
</section>
<section>
<section id="slide-sec-">
<h2 id="org63f6523">Jupyter Configuration</h2>
<div class="outline-text-2" id="text-org63f6523">
</div>
</section>
</section>
<section>
<section id="slide-sec-">
<h3 id="org5d8272f">RBAC</h3>
<p>
Don't be afraid of RBAC.  It's not that bad.  Create service accounts,
roles, and rolebindings for the capabilities your system needs (mostly
the Hub, but not entirely).
</p>

<p>
<a href="https://github.com/lsst-sqre/nublado/tree/master/jupyterhub/kubernetes">This is an example</a> for JupyterHub.
</p>

</section>
</section>
<section>
<section id="slide-sec-">
<h3 id="org0e0c6fe">Modular config files as ConfigMaps</h3>
<div class="outline-text-3" id="text-org0e0c6fe">
</div>
</section>
<section id="slide-sec-">
<h4 id="org5ab46d6">Examples</h4>
<p>
This is a <a href="https://github.com/lsst-sqre/nublado/blob/master/jupyterhub/jupyterhub_config/jupyterhub_config.py">JupyterHub minimal configuration wrapper</a> that loads the (sorted)
contents of a configuration directory.
</p>

<p>
This is <a href="https://github.com/lsst-sqre/nublado/blob/master/jupyterhub/sample_configs/30-environment.py">one of the files it loads.</a>
</p>

</section>
<section id="slide-sec-">
<h4 id="org7e59104">Substitute values from secrets or environment</h4>
<p>
Let's look in a bit more detail at
<a href="https://github.com/lsst-sqre/nublado/blob/master/jupyterhub/sample_configs/30-environment.py">that file</a>.
</p>

</section>
<section id="slide-sec-">
<h4 id="org7c7d228">ConfigMaps should be usable across sites.</h4>
<p>
If they are not, then you need to have more environmental variables or
secrets, and set configuration variables from them.
</p>

</section>
</section>
<section>
<section id="slide-sec-">
<h3 id="orgb908996">Make authentication someone else's problem</h3>
<p>
This is one of the classical examples of "you really shouldn't do it
yourself."
</p>

<p>
Are you <b>really</b> such a special snowflake that "users are members of
groups, and groups map to capabilities" won't work for you?
</p>

</section>
<section id="slide-sec-">
<h4 id="orgbc080ef">OAuth2 is generally a very good solution</h4>
<p>
Widely supported, good JupyterHub support, easy to add support for new
providers by cargo-culting existing providers in JupyterHub&#x2026;
</p>

<p>
<a href="https://github.com/lsst-sqre/nublado/blob/master/jupyterhub/sample_configs/10-authenticator.py">This</a> is our configuration.
</p>

</section>
<section id="slide-sec-">
<h4 id="org84fa87a">We use JWT for SSO and it seems to work fine</h4>
<p>
Some <a href="https://github.com/lsst-sqre/nublado/blob/master/proxy/kubernetes/ingress.template.yml#L11">ingress annotations</a> for Nginx so if you don't have the right
headers you're redirected through an OAuth flow, and then you get the
right headers.  <a href="https://github.com/lsst-sqre/nublado/blob/master/jupyterhub/sample_configs/10-authenticator.py#L315">Validate and parse those headers</a> when you receive them
in the Hub, and you're done.
</p>

</section>
<section id="slide-sec-">
<h4 id="org329f27e">The NCSA IDP for CILogon supports associated identities</h4>
<p>
Once you set up your NCSA identity, you can link it to other
CILogon-supported auth systems and use those (e.g. GitHub, SLAC,
Caltech&#x2026;) to do the OAuth flow.  You still get back the NCSA
user/group info, but you can authenticate through another provider.
</p>

<p>
If you're me and your computer has been on more than ten minutes you're
probably authenticated to Google or GitHub already.
</p>

</section>
<section id="slide-sec-">
<h4 id="orgc7d8114">Your authenticator should support a "group" concept.</h4>
<p>
This makes data access (see below) and user capabilities easy to
implement.  A group, almost by definition, maps to a set of capabilities
(although those capabilities are often not factored in a useful way).
</p>

</section>
</section>
<section>
<section id="slide-sec-">
<h3 id="orgd8683bf">Make your spawner spawn each user's resources in a separate namespace</h3>
<p>
Kubespawner now supports this directly (although we're using an earlier
implementation until I have time to migrate us).
</p>

</section>
