LBL-Jupyter-talk.org
*** Makes cleanup at logout a great deal easier

There is some debate over whether destroying a namespace at logout is a
good idea.  I vote for it: it's fast and easy to create namespaces, and
destroying them destroys all namespaced resources so you can be a lot
less careful on teardown.  (This gets particularly important if you're
creating many user-specific ConfigMaps.)

*** Makes quota support easy

Set number of CPUs and amount of memory for the namespace.  You can also
set object count quotas in modern Kubernetes, which gives you a huge
amount of flexibility (at the expense of complexity).

*** Leverage groups to control quotas

This is why it's useful to conceptualize a group as a capability map.
Some classes of users may be entitled to more resources than others.

** Custom spawner page

[[https://github.com/lsst-sqre/nublado/blob/master/jupyterhub/sample_configs/20-spawner.py#L90][Here]] is our (quite crude) implementation.

*** Leverage groups to control image, feature, or resource availability

We aren't actually doing this yet...but since we know the user and the
user's groups at presenting-the-option-form time, we could do things
like...

#+REVEAL: split

**** Allow a choice of different container images depending on the user group

E.g. a courseware setting, where people in a "biology" group see the
images with biology stacks, and those in an "astronomy" group see those
with astronomy stacks.

Or perhaps you show experimental builds only to users who have opted-in
to the "living dangerously" group.

#+REVEAL: split

**** Allow different resource profiles to members of different groups

We can control this at the namespace level too, but maybe only your
"power users" should have access to the 25-core 100-GB container sizes.

**** Choose CSS to do different skins for different groups

*** We're still investigating allowing multiple concurrent containers

If we keep our current namespace model, then each concurrent container
(which might be a set of containers--see Dask below) would get its own
namespace...

Which means that we'd have to track aggregate consumption and enforce it
at the Hub level.

** Spawning user containers

*** Be the User

The basic trick is to pass user info into the spawned container at
startup and [[https://github.com/lsst-sqre/nublado/tree/master/jupyterlab/prov][do provisioning there]].

This probably requires some privilege (e.g. add a user to the container,
and then sudo to the new user to start JupyterLab).

...there are some ways around that, but the cure may be worse than the
disease.

*** ConfigMaps

Define ConfigMaps (which are namespaced) at spawn time and map them into
the user's Lab container, or...

*** Complex environmental variables

Set up gid/groupname mappings, uid/username, and parse in the shell on
the far end...

This is what we've been doing, and we've found we need to...

**** base64-encode the really complicated stuff

[[https://github.com/lsst-sqre/nublado/blob/master/jupyterhub/sample_configs/20-spawner.py#L395][Here]] is how we do our initial Dask container template setup.

If you're finding you need to do that, maybe a ConfigMap is a better
idea?  We're going to be experimenting with that in the near future.

** Persistent Storage

Presuming you have a concept of users and groups already, which you
should, then you just need a consistent and persistent way to assign
uids/gids.

Your internal LDAP system probably already does this.  GitHub has unique
32-bit identifiers for users and groups.

Google has 64-bit identifiers so you're going to need your own mapping
to make it 32 bits, which is important, because...

*** File ownership and collaboration

If UIDs/GIDs are globally consistent, this is just the Unix permissions
model we have understood for 40 years.  You can do POSIX ACLs on many
filesystems, too, if you need something more sophisticated.  Modern
Linux allows 32-bit values for each of these, which works nicely with
GitHub, for instance.

*** NFS?

Yes, _but_... It's slow, locking is a nightmare, and if you want to do
non-default options you have to define your own pseudo-namespaced PV for
each filesystem (PVs are not namespaced objects) and then hook a namespaced PVC up to
it, and tear those down at logout (the PV, of course, isn't torn down
with the namespace).

All this is doable--we do it--but it's a pain.

*** HostPath

"Get out of jail free."  But also more dangerous (that is, jails exist
for a reason!), and not officially supported for MultiWrite.  That said,
GPFS seems to work for us, and it is much more performant than
NFS-reexport-of-GPFS.

** Intermediate-scale parallel processing

*** Things too big to fit in a single Python process/cell

Say, a handful of columns across a couple billion rows.
[[https://github.com/lsst-sqre/notebook-demo/blob/master/experiments/DASK-notebooks/gaia_all_sky.ipynb][(GAIA DR2, "l" and "b" columns only)]]

*** But not so big you want to go with full-on HTCondor yet

For instance, the LSST DR11 final catalog size will be about 15PB.  If
you're doing something that cuts across the whole catalog...at this
point in history, you need a big batch system to do that.

*** We use Dask in this realm; YMMV

My expectation is that by the end of the survey, many things we would
now go to a batch environment for will be reasonably doable in an
interactive Dask-like framework.  15PB of catalog data?  I doubt it,
but...

** Considerations for using Dask
*** Keeping Python libraries and versions synced

We cheat: your Dask workers are spawned from the same container image
you're using, but with a [[https://github.com/lsst-sqre/nublado/blob/master/jupyterlab/runlab.sh#L135][different environmental flag]] set to say "be a
Dask worker, not a JupyterLab server."

This might not be a cheat.  If, like LSST, a lot of the bulk of your
container is your particular complex analysis framework...this may
be the sensible way to do it.

*** Need additional Role/ServiceAccount/Rolebinding to allow Lab to spawn Dask

We populate a Dask worker yml document at each login that does the right
thing.  It's in your space so you can modify it, but...at your own risk
and you're still subject to quotas.

#+REVEAL: split

Note that if we move to a ConfigMap for this, rather than writing it
from the environment, then it won't be directly modifiable, but you can
always copy it from a read-only location to your own space and then use
that modified copy as the source to spawn new containers from.

We anticipate very few users will ever need this level of control.

