LBL-Jupyter-talk.html
<section id="slide-sec-">
<h4 id="org5b2bd22">Makes cleanup at logout a great deal easier</h4>
<p>
There is some debate over whether destroying a namespace at logout is a
good idea.  I vote for it: it's fast and easy to create namespaces, and
destroying them destroys all namespaced resources so you can be a lot
less careful on teardown.  (This gets particularly important if you're
creating many user-specific ConfigMaps.)
</p>

</section>
<section id="slide-sec-">
<h4 id="orgccf28d1">Makes quota support easy</h4>
<p>
Set number of CPUs and amount of memory for the namespace.  You can also
set object count quotas in modern Kubernetes, which gives you a huge
amount of flexibility (at the expense of complexity).
</p>

</section>
<section id="slide-sec-">
<h4 id="orga376947">Leverage groups to control quotas</h4>
<p>
This is why it's useful to conceptualize a group as a capability map.
Some classes of users may be entitled to more resources than others.
</p>

</section>
</section>
<section>
<section id="slide-sec-">
<h3 id="orgb04a621">Custom spawner page</h3>
<p>
<a href="https://github.com/lsst-sqre/nublado/blob/master/jupyterhub/sample_configs/20-spawner.py#L90">Here</a> is our (quite crude) implementation.
</p>

</section>
<section id="slide-sec-">
<h4 id="org1ab932b">Leverage groups to control image, feature, or resource availability</h4>
<p>
We aren't actually doing this yet&#x2026;but since we know the user and the
user's groups at presenting-the-option-form time, we could do things
like&#x2026;
</p>

</section>
<section >

<ul class="org-ul">
<li><a id="orgb9a4465"></a>Allow a choice of different container images depending on the user group<br />
<p>
E.g. a courseware setting, where people in a "biology" group see the
images with biology stacks, and those in an "astronomy" group see those
with astronomy stacks.
</p>

<p>
Or perhaps you show experimental builds only to users who have opted-in
to the "living dangerously" group.
</p>

</section>
<section >
</li>

<li><a id="org1763cc5"></a>Allow different resource profiles to members of different groups<br />
<p>
We can control this at the namespace level too, but maybe only your
"power users" should have access to the 25-core 100-GB container sizes.
</p>
</li>

<li><a id="org467e1b2"></a>Choose CSS to do different skins for different groups<br /></li>
</ul>

</section>
<section id="slide-sec-">
<h4 id="org88de26b">We're still investigating allowing multiple concurrent containers</h4>
<p>
If we keep our current namespace model, then each concurrent container
(which might be a set of containers&#x2013;see Dask below) would get its own
namespace&#x2026;
</p>

<p>
Which means that we'd have to track aggregate consumption and enforce it
at the Hub level.
</p>

</section>
</section>
<section>
<section id="slide-sec-">
<h3 id="orgcdd6106">Spawning user containers</h3>
<div class="outline-text-3" id="text-orgcdd6106">
</div>
</section>
<section id="slide-sec-">
<h4 id="org0d2fb23">Be the User</h4>
<p>
The basic trick is to pass user info into the spawned container at
startup and <a href="https://github.com/lsst-sqre/nublado/tree/master/jupyterlab/prov">do provisioning there</a>.
</p>

<p>
This probably requires some privilege (e.g. add a user to the container,
and then sudo to the new user to start JupyterLab).
</p>

<p>
&#x2026;there are some ways around that, but the cure may be worse than the
disease.
</p>

</section>
<section id="slide-sec-">
<h4 id="orgbd2d90c">ConfigMaps</h4>
<p>
Define ConfigMaps (which are namespaced) at spawn time and map them into
the user's Lab container, or&#x2026;
</p>

</section>
<section id="slide-sec-">
<h4 id="org9b55a57">Complex environmental variables</h4>
<p>
Set up gid/groupname mappings, uid/username, and parse in the shell on
the far end&#x2026;
</p>

<p>
This is what we've been doing, and we've found we need to&#x2026;
</p>

<ul class="org-ul">
<li><a id="org6c7a837"></a>base64-encode the really complicated stuff<br />
<p>
<a href="https://github.com/lsst-sqre/nublado/blob/master/jupyterhub/sample_configs/20-spawner.py#L395">Here</a> is how we do our initial Dask container template setup.
</p>

<p>
If you're finding you need to do that, maybe a ConfigMap is a better
idea?  We're going to be experimenting with that in the near future.
</p>
</li>
</ul>

</section>
</section>
<section>
<section id="slide-sec-">
<h3 id="org194147f">Persistent Storage</h3>
<p>
Presuming you have a concept of users and groups already, which you
should, then you just need a consistent and persistent way to assign
uids/gids.
</p>

<p>
Your internal LDAP system probably already does this.  GitHub has unique
32-bit identifiers for users and groups.
</p>

<p>
Google has 64-bit identifiers so you're going to need your own mapping
to make it 32 bits, which is important, because&#x2026;
</p>

</section>
<section id="slide-sec-">
<h4 id="orgda5aaea">File ownership and collaboration</h4>
<p>
If UIDs/GIDs are globally consistent, this is just the Unix permissions
model we have understood for 40 years.  You can do POSIX ACLs on many
filesystems, too, if you need something more sophisticated.  Modern
Linux allows 32-bit values for each of these, which works nicely with
GitHub, for instance.
</p>

</section>
<section id="slide-sec-">
<h4 id="orgb2f9674">NFS?</h4>
<p>
Yes, <span class="underline">but</span>&#x2026; It's slow, locking is a nightmare, and if you want to do
non-default options you have to define your own pseudo-namespaced PV for
each filesystem (PVs are not namespaced objects) and then hook a namespaced PVC up to
it, and tear those down at logout (the PV, of course, isn't torn down
with the namespace).
</p>

<p>
All this is doable&#x2013;we do it&#x2013;but it's a pain.
</p>

</section>
<section id="slide-sec-">
<h4 id="orgae0dd32">HostPath</h4>
<p>
"Get out of jail free."  But also more dangerous (that is, jails exist
for a reason!), and not officially supported for MultiWrite.  That said,
GPFS seems to work for us, and it is much more performant than
NFS-reexport-of-GPFS.
</p>

</section>
</section>
<section>
<section id="slide-sec-">
<h3 id="orge69d51f">Intermediate-scale parallel processing</h3>
<div class="outline-text-3" id="text-orge69d51f">
</div>
</section>
<section id="slide-sec-">
<h4 id="org2fc0a7c">Things too big to fit in a single Python process/cell</h4>
<p>
Say, a handful of columns across a couple billion rows.
<a href="https://github.com/lsst-sqre/notebook-demo/blob/master/experiments/DASK-notebooks/gaia_all_sky.ipynb">(GAIA DR2, "l" and "b" columns only)</a>
</p>

</section>
<section id="slide-sec-">
<h4 id="org8b26555">But not so big you want to go with full-on HTCondor yet</h4>
<p>
For instance, the LSST DR11 final catalog size will be about 15PB.  If
you're doing something that cuts across the whole catalog&#x2026;at this
point in history, you need a big batch system to do that.
</p>

</section>
<section id="slide-sec-">
<h4 id="orgeb18904">We use Dask in this realm; YMMV</h4>
<p>
My expectation is that by the end of the survey, many things we would
now go to a batch environment for will be reasonably doable in an
interactive Dask-like framework.  15PB of catalog data?  I doubt it,
but&#x2026;
</p>

</section>
</section>
<section>
<section id="slide-sec-">
<h3 id="orgf076098">Considerations for using Dask</h3>
<div class="outline-text-3" id="text-orgf076098">
</div>
</section>
<section id="slide-sec-">
<h4 id="org3cc36d4">Keeping Python libraries and versions synced</h4>
<p>
We cheat: your Dask workers are spawned from the same container image
you're using, but with a <a href="https://github.com/lsst-sqre/nublado/blob/master/jupyterlab/runlab.sh#L135">different environmental flag</a> set to say "be a
Dask worker, not a JupyterLab server."
</p>

<p>
This might not be a cheat.  If, like LSST, a lot of the bulk of your
container is your particular complex analysis framework&#x2026;this may
be the sensible way to do it.
</p>

</section>
<section id="slide-sec-">
<h4 id="org50abdde">Need additional Role/ServiceAccount/Rolebinding to allow Lab to spawn Dask</h4>
<p>
We populate a Dask worker yml document at each login that does the right
thing.  It's in your space so you can modify it, but&#x2026;at your own risk
and you're still subject to quotas.
</p>

</section>
<section >

<p>
Note that if we move to a ConfigMap for this, rather than writing it
from the environment, then it won't be directly modifiable, but you can
always copy it from a read-only location to your own space and then use
that modified copy as the source to spawn new containers from.
</p>

<p>
We anticipate very few users will ever need this level of control.
</p>

</section>
